# Re-snapshot from a fully-set-up machine with:
#   brew bundle dump --file=Brewfile --force --describe

# --- CLIs ---
brew "git"
brew "gh"
brew "mise"
brew "jq"
brew "ripgrep"
brew "fzf"

# --- Apps ---
cask "raycast"
cask "thebrowsercompany-dia"   # The Browser Company's Dia
cask "1password"
cask "1password-cli"
cask "visual-studio-code"
cask "claude-code"

# Previously via Setapp — now standalone (separate licenses):
cask "displaperture"
cask "istat-menus"
cask "cleanshot"
cask "tableplus"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"
